cask_args appdir: "/Applications"

brew "awscli"
brew "aws-shell"
brew "azure-cli"
brew "ccat"
brew "chruby"
brew "cmake"
brew "direnv"
brew "dockutil"
brew "fzf"
brew "git"
brew "golang"
brew "htop"
brew "jq"
brew "lastpass-cli"
brew "mysql"
brew "node"
brew "postgres"
brew "pwgen"
brew "python"
brew "ruby-install"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim", args: ["with-lua"]
brew "watch"
brew "wget"
brew "yarn"


tap "cloudfoundry/tap"
brew "cf-cli"
brew "bosh-cli"
brew "bbl"

tap "git-duet/tap"
brew "git-duet"

tap "starkandwayne/cf"
# brew "yaml2json"
brew "spruce"

tap "xoebus/homebrew-cloudfoundry"
brew "spiff"

tap "caskroom/cask"
cask "atom"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flycut"
cask "goland"
cask "istat-menus"
cask "iterm2"
cask "java8"
cask "slack"
cask "sublime-text"
cask "time-out"
cask "tunnelblick"
cask "webstorm"
cask "xscreensaver"
cask "zoomus"

#flyway needs to be after java, and chromedriver is last for superstition
brew "flyway"
brew "chromedriver"

